{"LicenseText": """OpenTVD: Свободный Телеграм бот для загрузки видео с разных платформ
Copyright (C) 2024 Fun_Dan3

Это программа является свободным программным обеспечением: вы можете распространять и/или модифицировать
её согласно условиям Стандартной Общественной Лицензии GNU, опубликованной
Фондом Свободного Программного Обеспечения, версии 3 или,
по Вашему желанию, любой более поздней версии.

Эта программа распространяется в надежде, что она будет полезной,
но БЕЗ ВСЯКИХ ГАРАНТИЙ, в том числе подразумеваемых гарантий
ТОВАРНОГО СОСТОЯНИЯ ПРИ ПРОДАЖЕ и ГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОГО ПРИМЕНЕНИЯ.
Смотрите Стандартную Общественную Лицензию GNU для получения дополнительной информации.
Для просмотра полной Стандартной Общественной Лицензии GNU посетите <http://www.gnu.org/licenses/>.
Для связи с автором Программного Обеспечения напишите имейл на dfr34560@gmail.com
Исходный код: <https://github.com/FunDan3/OpenTVD/>""",



"StartText": """OpenTVD это свободный телеграм бот для загрузки видео с разных платформ. Без рекламы!

Список поддерживаемых платформ:
- YouTube

Чтобы начать скачивание просто пришлите боту ссылку на видео.
Оно будет скачанно автоматически (Возможно будет предложен выбор разрешения и формата файла).
Запуская загрузку вы соглашаетесь с лицензией. Её можно просмотреть введя /license.
Содержимое сообщения хранится только во время загрузки, после чего удаляется (вместе с скачанным видео).
Остальные данные не хранятся.""",



"UrlInvalid": "Кажется, что ссылка некорректна...",
"UnknownService": "Бот ещё не поддерживает этот сервис.",
"YTAudioButton": "Только Звук",
"YTVideoButton": "Звук и Видео",
"AudioOrVideo": "Хотите ли вы только аудио или и аудио и видео?",
"FetchingStreams": "Загрузка потоков. Пожалуйста подождите немного.",
"AlreadyDownloading": "Вы уже скачиваете видео с YouTube. Вы не можете начать другую загрузку сейчас",
"DownloadFinished": "Контент был загружен на сервер и сейчас передаётся через телеграм. Обычно это занимает столько же, сколько и загрузка.",
"PickResolution": "Выберите желаемое разрешение.",
"TooLarge": "OpenTVD ещё не поддерживает загрузку настолько больших файлов. Это ограничение телеграма"}
